portico/PorticoAutoSubTests.json

{
   "tests":[
      {
         "name":"clinicOrOther",
         "request":{
            "type":"soapRequest",
            "data":"<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><soap:Body><PosRequest xmlns=\"http://Hps.Exchange.PosGateway\"><Ver1.0><Header><SecretAPIKey>skapi_cert_MTeSAQAfG1UA9qQDrzl-kz4toXvARyieptFwSKP24w</SecretAPIKey><PosReqDT>2020-05-29T14:09:43.865+03:00</PosReqDT></Header><Transaction><CreditSale><Block1><AllowDup>Y</AllowDup><AllowPartialAuth>N</AllowPartialAuth><Amt>215</Amt><CardData><ManualEntry><CardNbr>411111XXXXXX1111</CardNbr><ExpMonth>12</ExpMonth><ExpYear>2025</ExpYear><CVV2>123</CVV2><ReaderPresent>N</ReaderPresent><CardPresent>N</CardPresent></ManualEntry><TokenRequest>N</TokenRequest></CardData><AutoSubstantiation><FirstAdditionalAmtInfo><AmtType>TOTAL_HEALTHCARE_AMT</AmtType><Amt>15000</Amt></FirstAdditionalAmtInfo><SecondAdditionalAmtInfo><AmtType>SUBTOTAL_CLINIC_OR_OTHER_AMT</AmtType><Amt>15000</Amt></SecondAdditionalAmtInfo><MerchantVerificationValue>12345</MerchantVerificationValue><RealTimeSubstantiation>N</RealTimeSubstantiation></AutoSubstantiation></Block1></CreditSale></Transaction></Ver1.0></PosRequest></soap:Body></soap:Envelope>"
         },
         "response":{
            "type":"codeResponse",
            "data":"00"
         }
      },
      {
         "name":"dental",
         "request":{
            "type":"soapRequest",
            "data":"<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n<soap:Envelope\n  xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"\n  xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n  xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n  <soap:Body>\n    <PosRequest\n      xmlns=\"http://Hps.Exchange.PosGateway\">\n      <Ver1.0>\n        <Header>\n          <SecretAPIKey>skapi_cert_MTeSAQAfG1UA9qQDrzl-kz4toXvARyieptFwSKP24w</SecretAPIKey>\n          <PosReqDT>2020-05-28T10:38:59.649+03:00</PosReqDT>\n        </Header>\n        <Transaction>\n          <CreditSale>\n            <Block1>\n              <AllowDup>Y</AllowDup>\n              <AllowPartialAuth>N</AllowPartialAuth>\n              <Amt>215</Amt>\n              <CardData>\n                <ManualEntry>\n                  <CardNbr>411111XXXXXX1111</CardNbr>\n                  <ExpMonth>12</ExpMonth>\n                  <ExpYear>2025</ExpYear>\n                  <CVV2>123</CVV2>\n                  <ReaderPresent>N</ReaderPresent>\n                  <CardPresent>N</CardPresent>\n                </ManualEntry>\n                <TokenRequest>N</TokenRequest>\n              </CardData>\n              <AutoSubstantiation>\n                <FirstAdditionalAmtInfo>\n                  <AmtType>SUBTOTAL_DENTAL_AMT</AmtType>\n                  <Amt>15000</Amt>\n                </FirstAdditionalAmtInfo>\n                <SecondAdditionalAmtInfo>\n                  <AmtType>TOTAL_HEALTHCARE_AMT</AmtType>\n                  <Amt>15000</Amt>\n                </SecondAdditionalAmtInfo>\n                <MerchantVerificationValue>12345</MerchantVerificationValue>\n                <RealTimeSubstantiation>N</RealTimeSubstantiation>\n              </AutoSubstantiation>\n            </Block1>\n          </CreditSale>\n        </Transaction>\n      </Ver1.0>\n    </PosRequest>\n  </soap:Body>\n</soap:Envelope>"
         },
         "response":{
            "type":"codeResponse",
            "data":"00"
         }
      },
      {
         "name":"vision",
         "request":{
            "type":"soapRequest",
            "data":"<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><soap:Body><PosRequest xmlns=\"http://Hps.Exchange.PosGateway\"><Ver1.0><Header><SecretAPIKey>skapi_cert_MTeSAQAfG1UA9qQDrzl-kz4toXvARyieptFwSKP24w</SecretAPIKey><PosReqDT>2020-06-12T14:38:41.885+03:00</PosReqDT></Header><Transaction><CreditSale><Block1><AllowDup>Y</AllowDup><AllowPartialAuth>N</AllowPartialAuth><Amt>215</Amt><CardData><TrackData method=\"swipe\">&lt;E1050711%B401200XXXXXX0016^VI TEST CREDIT^251200000000000000000000?|LO04K0WFOmdkDz0um+GwUkILL8ZZOP6Zc4rCpZ9+kg2T3JBT4AEOilWTI|+++++++Dbbn04ekG|11;401200XXXXXX0016=25120000000000000000?|1u2F/aEhbdoPixyAPGyIDv3gBfF|+++++++Dbbn04ekG|00|||/wECAQECAoFGAgEH2wYcShV78RZwb3NAc2VjdXJlZXhjaGFuZ2UubmV0PX50qfj4dt0lu9oFBESQQNkpoxEVpCW3ZKmoIV3T93zphPS3XKP4+DiVlM8VIOOmAuRrpzxNi0TN/DWXWSjUC8m/PI2dACGdl/hVJ/imfqIs68wYDnp8j0ZfgvM26MlnDbTVRrSx68Nzj2QAgpBCHcaBb/FZm9T7pfMr2Mlh2YcAt6gGG1i2bJgiEJn8IiSDX5M2ybzqRT86PCbKle/XCTwFFe1X|&gt;;</TrackData><EncryptionData><Version>01</Version></EncryptionData><TokenRequest>N</TokenRequest></CardData><AutoSubstantiation><FirstAdditionalAmtInfo><AmtType>SUBTOTAL_VISION__OPTICAL_AMT</AmtType><Amt>15000</Amt></FirstAdditionalAmtInfo><SecondAdditionalAmtInfo><AmtType>TOTAL_HEALTHCARE_AMT</AmtType><Amt>15000</Amt></SecondAdditionalAmtInfo><MerchantVerificationValue>12345</MerchantVerificationValue><RealTimeSubstantiation>N</RealTimeSubstantiation></AutoSubstantiation></Block1></CreditSale></Transaction></Ver1.0></PosRequest></soap:Body></soap:Envelope>"
         },
         "response":{
            "type":"codeResponse",
            "data":"00"
         }
      },
      {
         "name":"prescription",
         "request":{
            "type":"soapRequest",
            "data":"<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><soap:Body><PosRequest xmlns=\"http://Hps.Exchange.PosGateway\"><Ver1.0><Header><SecretAPIKey>skapi_cert_MTeSAQAfG1UA9qQDrzl-kz4toXvARyieptFwSKP24w</SecretAPIKey><PosReqDT>2020-06-12T14:38:44.509+03:00</PosReqDT></Header><Transaction><CreditSale><Block1><AllowDup>Y</AllowDup><AllowPartialAuth>N</AllowPartialAuth><Amt>215</Amt><CardData><TrackData method=\"swipe\">&lt;E1050711%B401200XXXXXX0016^VI TEST CREDIT^251200000000000000000000?|LO04K0WFOmdkDz0um+GwUkILL8ZZOP6Zc4rCpZ9+kg2T3JBT4AEOilWTI|+++++++Dbbn04ekG|11;401200XXXXXX0016=25120000000000000000?|1u2F/aEhbdoPixyAPGyIDv3gBfF|+++++++Dbbn04ekG|00|||/wECAQECAoFGAgEH2wYcShV78RZwb3NAc2VjdXJlZXhjaGFuZ2UubmV0PX50qfj4dt0lu9oFBESQQNkpoxEVpCW3ZKmoIV3T93zphPS3XKP4+DiVlM8VIOOmAuRrpzxNi0TN/DWXWSjUC8m/PI2dACGdl/hVJ/imfqIs68wYDnp8j0ZfgvM26MlnDbTVRrSx68Nzj2QAgpBCHcaBb/FZm9T7pfMr2Mlh2YcAt6gGG1i2bJgiEJn8IiSDX5M2ybzqRT86PCbKle/XCTwFFe1X|&gt;;</TrackData><EncryptionData><Version>01</Version></EncryptionData><TokenRequest>N</TokenRequest></CardData><AutoSubstantiation><FirstAdditionalAmtInfo><AmtType>TOTAL_HEALTHCARE_AMT</AmtType><Amt>15000</Amt></FirstAdditionalAmtInfo><SecondAdditionalAmtInfo><AmtType>SUBTOTAL_PRESCRIPTION_AMT</AmtType><Amt>15000</Amt></SecondAdditionalAmtInfo><MerchantVerificationValue>12345</MerchantVerificationValue><RealTimeSubstantiation>N</RealTimeSubstantiation></AutoSubstantiation></Block1></CreditSale></Transaction></Ver1.0></PosRequest></soap:Body></soap:Envelope>"
         },
         "response":{
            "type":"codeResponse",
            "data":"00"
         }
      },
      {
         "name":"twoSubTotals",
         "request":{
            "type":"soapRequest",
            "data":"<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><soap:Body><PosRequest xmlns=\"http://Hps.Exchange.PosGateway\"><Ver1.0><Header><SecretAPIKey>skapi_cert_MTeSAQAfG1UA9qQDrzl-kz4toXvARyieptFwSKP24w</SecretAPIKey><PosReqDT>2020-06-12T14:38:43.141+03:00</PosReqDT></Header><Transaction><CreditSale><Block1><AllowDup>Y</AllowDup><AllowPartialAuth>N</AllowPartialAuth><Amt>215</Amt><CardData><ManualEntry><CardNbr>411111XXXXXX1111</CardNbr><ExpMonth>12</ExpMonth><ExpYear>2025</ExpYear><CVV2>123</CVV2><ReaderPresent>N</ReaderPresent><CardPresent>N</CardPresent></ManualEntry><TokenRequest>N</TokenRequest></CardData><AutoSubstantiation><FirstAdditionalAmtInfo><AmtType>SUBTOTAL_VISION__OPTICAL_AMT</AmtType><Amt>2500</Amt></FirstAdditionalAmtInfo><SecondAdditionalAmtInfo><AmtType>TOTAL_HEALTHCARE_AMT</AmtType><Amt>5000</Amt></SecondAdditionalAmtInfo><ThirdAdditionalAmtInfo><AmtType>SUBTOTAL_CLINIC_OR_OTHER_AMT</AmtType><Amt>2500</Amt></ThirdAdditionalAmtInfo><MerchantVerificationValue>12345</MerchantVerificationValue><RealTimeSubstantiation>N</RealTimeSubstantiation></AutoSubstantiation></Block1></CreditSale></Transaction></Ver1.0></PosRequest></soap:Body></soap:Envelope>"
         },
         "response":{
            "type":"codeResponse",
            "data":"00"
         }
      },
      {
         "name":"threeSubTotals",
         "request":{
            "type":"soapRequest",
            "data":"<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><soap:Body><PosRequest xmlns=\"http://Hps.Exchange.PosGateway\"><Ver1.0><Header><SecretAPIKey>skapi_cert_MTeSAQAfG1UA9qQDrzl-kz4toXvARyieptFwSKP24w</SecretAPIKey><PosReqDT>2020-06-12T14:58:17.516+03:00</PosReqDT></Header><Transaction><CreditSale><Block1><AllowDup>Y</AllowDup><AllowPartialAuth>N</AllowPartialAuth><Amt>215</Amt><CardData><TrackData method=\"swipe\">&lt;E1050711%B401200XXXXXX0016^VI TEST CREDIT^251200000000000000000000?|LO04K0WFOmdkDz0um+GwUkILL8ZZOP6Zc4rCpZ9+kg2T3JBT4AEOilWTI|+++++++Dbbn04ekG|11;401200XXXXXX0016=25120000000000000000?|1u2F/aEhbdoPixyAPGyIDv3gBfF|+++++++Dbbn04ekG|00|||/wECAQECAoFGAgEH2wYcShV78RZwb3NAc2VjdXJlZXhjaGFuZ2UubmV0PX50qfj4dt0lu9oFBESQQNkpoxEVpCW3ZKmoIV3T93zphPS3XKP4+DiVlM8VIOOmAuRrpzxNi0TN/DWXWSjUC8m/PI2dACGdl/hVJ/imfqIs68wYDnp8j0ZfgvM26MlnDbTVRrSx68Nzj2QAgpBCHcaBb/FZm9T7pfMr2Mlh2YcAt6gGG1i2bJgiEJn8IiSDX5M2ybzqRT86PCbKle/XCTwFFe1X|&gt;;</TrackData><EncryptionData><Version>01</Version></EncryptionData><TokenRequest>N</TokenRequest></CardData><AutoSubstantiation><FirstAdditionalAmtInfo><AmtType>SUBTOTAL_VISION__OPTICAL_AMT</AmtType><Amt>2500</Amt></FirstAdditionalAmtInfo><SecondAdditionalAmtInfo><AmtType>SUBTOTAL_DENTAL_AMT</AmtType><Amt>2500</Amt></SecondAdditionalAmtInfo><ThirdAdditionalAmtInfo><AmtType>TOTAL_HEALTHCARE_AMT</AmtType><Amt>7500</Amt></ThirdAdditionalAmtInfo><FourthAdditionalAmtInfo><AmtType>SUBTOTAL_CLINIC_OR_OTHER_AMT</AmtType><Amt>2500</Amt></FourthAdditionalAmtInfo><MerchantVerificationValue>12345</MerchantVerificationValue><RealTimeSubstantiation>N</RealTimeSubstantiation></AutoSubstantiation></Block1></CreditSale></Transaction></Ver1.0></PosRequest></soap:Body></soap:Envelope>"
         },
         "response":{
            "type":"codeResponse",
            "data":"00"
         }
      },
      {
         "name":"totalAmountTest",
         "request":{
            "type":"noRequest",
            "data":null
         },
         "response":{
            "type":"noResponse",
            "data":null
         }
      },
      {
         "name":"totalAmountTest2",
         "request":{
            "type":"noRequest",
            "data":null
         },
         "response":{
            "type":"noResponse",
            "data":null
         }
      }
   ]
}